import itertools
import pandas as pd
from itertools import combinations

pd.set_option('display.max_columns', None)

parameters = {
    "Час пограбування": [
        "1.1 Під час відкриття", 
        "1.2 День", 
        "1.3 Ніч"
    ],
    "Наявність зброї у грабіжників": [
        "2.1 Без зброї", 
        "2.2 Холодна зброя", 
        "2.3 Вогнепальна зброя"
    ],
    "Наявність клієнтів": [
        "3.1 Немає клієнтів", 
        "3.2 Один і більше клієнт"
    ],
    "Доступність шляхів відходу": [
        "4.1 Гарна (перевулки, паркування)", 
        "4.2 Погана (пробки, вузькі вулиці)"
    ],
    "Розташування ломбарду": [
        "5.1 ТРЦ", 
        "5.2 Самотній ломбард", 
        "5.3 Поряд з магазинами/кафе"
    ],
    "Швидкість прибуття поліції": [
        "6.1 3-7 хвилин", 
        "6.2 5-10 хвилин", 
        "6.3 10 хвилин і більше"
    ],
    "Кількість злочинців": [
        "7.1 Один", 
        "7.2 Два і більше"
    ]
}

probabilities = {
    "1.1 Під час відкриття": 0.2,
    "1.2 День": 0.5,
    "1.3 Ніч": 0.3,

    "2.1 Без зброї": 0.1,
    "2.2 Холодна зброя": 0.2,
    "2.3 Вогнепальна зброя": 0.7,

    "3.1 Немає клієнтів": 0.4,
    "3.2 Один і більше клієнт": 0.6,

    "4.1 Гарна (перевулки, паркування)": 0.4,
    "4.2 Погана (пробки, вузькі вулиці)": 0.6,

    "5.1 ТРЦ": 0.15,
    "5.2 Самотній ломбард": 0.35,
    "5.3 Поряд з магазинами/кафе": 0.5,

    "6.1 3-7 хвилин": 0.3,
    "6.2 5-10 хвилин": 0.4,
    "6.3 10 хвилин і більше": 0.3,

    "7.1 Один": 0.6,
    "7.2 Два і більше": 0.4
}
correlation_matrix = {
    "Наявність зброї у грабіжників": {
        "2.1 Без зброї": {
            "1.1 Під час відкриття": -0.5,
            "1.2 День": -1,
            "1.3 Ніч": 0.7
        },
        "2.2 Холодна зброя": {
            "1.1 Під час відкриття": 0.5,
            "1.2 День": 0.2,
            "1.3 Ніч": 0.5
        },
        "2.3 Вогнепальна зброя": {
            "1.1 Під час відкриття": 0.7,
            "1.2 День": 0.8,
            "1.3 Ніч": -0.6
        }
    },
    "Наявність клієнтів": {
        "3.1 Немає клієнтів": {
            "1.1 Під час відкриття": 0.8,
            "1.2 День": -0.5,
            "1.3 Ніч": 1,
            "2.1 Без зброї": 0.7,
            "2.2 Холодна зброя": 0.4,
            "2.3 Вогнепальна зброя": -0.3
        },
        "3.2 Один і більше клієнт": {
            "1.1 Під час відкриття": -0.9,
            "1.2 День": 0.6,
            "1.3 Ніч": -1,
            "2.1 Без зброї": -1,
            "2.2 Холодна зброя": -0.5,
            "2.3 Вогнепальна зброя": 0.9
        }
    },
    "Доступність шляхів відходу": {
        "4.1 Гарна (перевулки, паркування)": {
            "1.1 Під час відкриття": 0.5,
            "1.2 День": 0.7,
            "1.3 Ніч": -0.2,
            "2.1 Без зброї": 0,
            "2.2 Холодна зброя": 0,
            "2.3 Вогнепальна зброя": 0.3,
            "3.1 Немає клієнтів": 0,
            "3.2 Один і більше клієнт": 0
        },
        "4.2 Погана (пробки, вузькі вулиці)": {
            "1.1 Під час відкриття": -0.5,
            "1.2 День": -0.6,
            "1.3 Ніч": 0.3,
            "2.1 Без зброї": 0,
            "2.2 Холодна зброя": 0,
            "2.3 Вогнепальна зброя": -0.2,
            "3.1 Немає клієнтів": 0,
            "3.2 Один і більше клієнт": 0
        }
    },
    "Розташування ломбарду": {
        "5.1 ТРЦ": {
            "1.1 Під час відкриття": -0.5,
            "1.2 День": -0.9,
            "1.3 Ніч": 0.7,
            "2.1 Без зброї": 0.5,
            "2.2 Холодна зброя": 0.7,
            "2.3 Вогнепальна зброя": -0.3,
            "3.1 Немає клієнтів": -0.4,
            "3.2 Один і більше клієнт": 0.5,
            "4.1 Гарна (перевулки, паркування)": -1,
            "4.2 Погана (пробки, вузькі вулиці)": 1
        },
        "5.2 Самотній ломбард": {
            "1.1 Під час відкриття": 0.6,
            "1.2 День": 0.8,
            "1.3 Ніч": 0.5,
            "2.1 Без зброї": -0.4,
            "2.2 Холодна зброя": 0.3,
            "2.3 Вогнепальна зброя": 0.8,
            "3.1 Немає клієнтів": 0.2,
            "3.2 Один і більше клієнт": -0.3,
            "4.1 Гарна (перевулки, паркування)": 0.6,
            "4.2 Погана (пробки, вузькі вулиці)": -0.6
        },
        "5.3 Поряд з магазинами/кафе": {
            "1.1 Під час відкриття": 0.7,
            "1.2 День": 0.3,
            "1.3 Ніч": -0.4,
            "2.1 Без зброї": -0.6,
            "2.2 Холодна зброя": 0.4,
            "2.3 Вогнепальна зброя": 0.7,
            "3.1 Немає клієнтів": 0.1,
            "3.2 Один і більше клієнт": -0.2,
            "4.1 Гарна (перевулки, паркування)": 0.4,
            "4.2 Погана (пробки, вузькі вулиці)": -0.4
        }
    },
    "Швидкість прибуття поліції": {
        "6.1 3-7 хвилин": {
            "1.1 Під час відкриття": -0.3,
            "1.2 День": 0.2,
            "1.3 Ніч": 0.4,
            "2.1 Без зброї": 0,
            "2.2 Холодна зброя": 0,
            "2.3 Вогнепальна зброя": 0,
            "3.1 Немає клієнтів": 0,
            "3.2 Один і більше клієнт": 0,
            "4.1 Гарна (перевулки, паркування)": 0.2,
            "4.2 Погана (пробки, вузькі вулиці)": -0.2,
            "5.1 ТРЦ": 0.4
        },
        "6.2 5-10 хвилин": {
            "1.1 Під час відкриття": 0.5,
            "1.2 День": 0.4,
            "1.3 Ніч": 0.2,
            "2.1 Без зброї": 0,
            "2.2 Холодна зброя": 0,
            "2.3 Вогнепальна зброя": 0,
            "3.1 Немає клієнтів": 0,
            "3.2 Один і більше клієнт": 0,
            "4.1 Гарна (перевулки, паркування)": -0.1,
            "4.2 Погана (пробки, вузькі вулиці)": 0.2,
            "5.1 ТРЦ": -0.3
        },
        "6.3 10 хвилин і більше": {
            "1.1 Під час відкриття": -0.5,
            "1.2 День": -0.3,
            "1.3 Ніч": -0.6,
            "2.1 Без зброї": 0,
            "2.2 Холодна зброя": 0,
            "2.3 Вогнепальна зброя": 0,
            "3.1 Немає клієнтів": 0,
            "3.2 Один і більше клієнт": 0,
            "4.1 Гарна (перевулки, паркування)": -0.2,
            "4.2 Погана (пробки, вузькі вулиці)": 0.1,
            "5.1 ТРЦ": -0.6
        }
    },
    "Кількість злочинців": {
        "7.1 Один": {
            "1.1 Під час відкриття": 0.7,
            "1.2 День": -0.3,
            "1.3 Ніч": -0.3,
            "2.1 Без зброї": 0.1,
            "2.2 Холодна зброя": 0.2,
            "2.3 Вогнепальна зброя": 0.7,
            "3.1 Немає клієнтів": 0,
            "3.2 Один і більше клієнт": 0,
            "4.1 Гарна (перевулки, паркування)": 0.1,
            "4.2 Погана (пробки, вузькі вулиці)": 0.3,
            "5.1 ТРЦ": -0.7,
            "5.2 Самотній ломбард": 0.5,
            "5.3 Поряд з магазинами/кафе": 0.6
        },
        "7.1 Два і більше": {
            "1.1 Під час відкриття": -0.3,
            "1.2 День": 0.4,
            "1.3 Ніч": 0.5,
            "2.1 Без зброї": 0.3,
            "2.2 Холодна зброя": -0.3,
            "2.3 Вогнепальна зброя": 0.5,
            "3.1 Немає клієнтів": 0,
            "3.2 Один і більше клієнт": 0,
            "4.1 Гарна (перевулки, паркування)": 0.5,
            "4.2 Погана (пробки, вузькі вулиці)": -0.4,
            "5.1 ТРЦ": 0.9,
            "5.2 Самотній ломбард": 0.2,
            "5.3 Поряд з магазинами/кафе": -0.4,
            "6.1 3-7 хвилин":0,
            "6.2 5-10 хвилин":0,
            "6.3 10 хвилин і більше":0
        }
    }
}
all_combinations = list(itertools.product(*parameters.values()))

df = pd.DataFrame(all_combinations, columns=parameters.keys())
df["Сукупна ймовірність"] = df.apply(lambda row: 
    probabilities[row["Час пограбування"]] *
    probabilities[row["Наявність зброї у грабіжників"]] *
    probabilities[row["Наявність клієнтів"]] *
    probabilities[row["Доступність шляхів відходу"]] *
    probabilities[row["Розташування ломбарду"]] *
    probabilities[row["Швидкість прибуття поліції"]] *
    probabilities[row["Кількість злочинців"]], axis=1
)
def calculate_correlation_product(row, correlation_matrix):
    result = 1.0
    for param1, param2 in itertools.combinations(row, 2):
        
        for _,values in correlation_matrix.items():
            if param1 in values and param2 in values[param1]:
                corr = values[param1][param2]
                break
            elif param2 in values and param1 in values[param2]:
                corr = values[param2][param1]
                break
        result *= (1 + corr)
    return result


df["Сукупна кореляція"] = df.apply(calculate_correlation_product, axis=1, correlation_matrix=correlation_matrix)
df["Ймовірність на кореляцію"] = df["Сукупна ймовірність"] * df["Сукупна кореляція"]

total_prob = df["Ймовірність на кореляцію"].sum()
df["Ймовірність поділена на кореляцію"] = df["Ймовірність на кореляцію"] / total_prob
palts=[]
for keys,values in parameters.items():
        for value in values:
            total=0 
            for _,row in df.iterrows():
                if value in row.values:
                    total=total+row["Ймовірність поділена на кореляцію"]
            palts.append(total)

correlation_matrix1 = {
        "1.1 Під час відкриття": {
            "Найм охоронця": 0.5,
            "Установка тривожної кнопки": 0.2,
            "Датчики руху, сигналізація": 0,
            "Камери": 0.6,
            "Куленепробивне скло": 0,
            "Ротація змін": 0.8
        },
        "1.2 День": {
            "Найм охоронця": 0.6,
            "Установка тривожної кнопки": 0.4,
            "Датчики руху, сигналізація": 0,
            "Камери": 0.5,
            "Куленепробивне скло": 0.6,
            "Ротація змін": 0.5
        },
        "1.3 Ніч": {
            "Найм охоронця": 0,
            "Установка тривожної кнопки": 0,
            "Датчики руху, сигналізація": 0.9,
            "Камери": -0.3,
            "Куленепробивне скло": 0,
            "Ротація змін": 0.2
        },
        "2.1 Без зброї": {
            "Найм охоронця": 0.9,
            "Установка тривожної кнопки": 0.8,
            "Датчики руху, сигналізація": 0.6,
            "Камери": 0,
            "Куленепробивне скло": -0.3,
            "Ротація змін": 0
        },
        "2.2 Холодна зброя": {
            "Найм охоронця": 0.8,
            "Установка тривожної кнопки": 0.7,
            "Датчики руху, сигналізація": 0.7,
            "Камери": 0,
            "Куленепробивне скло": -0.3,
            "Ротація змін": 0
        },
        "2.3 Вогнепальна зброя": {
            "Найм охоронця": -0.7,
            "Установка тривожної кнопки": -0.8,
            "Датчики руху, сигналізація": -0.6,
            "Камери": 0,
            "Куленепробивне скло": 0.9,
            "Ротація змін": 0
        },
        "3.1 Немає клієнтів": {
            "Камери": 0.9,
            "Найм охоронця": 0,
            "Установка тривожної кнопки": 0,
            "Датчики руху, сигналізація": 0,
            "Куленепробивне скло": 0,
            "Ротація змін": 0
        },
        "3.2 Один і більше клієнт": {
            "Камери": -0.8,
            "Найм охоронця": 0,
            "Установка тривожної кнопки": 0,
            "Датчики руху, сигналізація": 0,
            "Куленепробивне скло": 0,
            "Ротація змін": 0
        },
        "4.1 Гарна (перевулки, паркування і т.д.)": {
            "Найм охоронця": -0.3,
            "Установка тривожної кнопки": -0.5,
            "Датчики руху, сигналізація": 0.3,
            "Камери": -0.4,
            "Куленепробивне скло": 0,
            "Ротація змін": 0.3
        },
        "4.2 Погана (пробки, вузькі вулиці)": {
            "Найм охоронця": 0.3,
            "Установка тривожної кнопки": 0.7,
            "Датчики руху, сигналізація": -0.4,
            "Камери": 0.5,
            "Куленепробивне скло": 0,
            "Ротація змін": -0.3
        },
        "5.1 ТРЦ": {
            "Найм охоронця": -0.8,
            "Установка тривожної кнопки": -0.4,
            "Датчики руху, сигналізація": -0.6,
            "Камери": -0.5,
            "Куленепробивне скло": -0.4,
            "Ротація змін": 0.3
        },
        "5.2 Самотній ломбард": {
            "Найм охоронця": 0.7,
            "Установка тривожної кнопки": 0.6,
            "Датчики руху, сигналізація": 0.4,
            "Камери": 0.7,
            "Куленепробивне скло": 0.6,
            "Ротація змін": 0.6
        },
        "5.3 Поряд з різними магазинами/кафе": {
            "Найм охоронця": 0.5,
            "Установка тривожної кнопки": 0.4,
            "Датчики руху, сигналізація": 0.3,
            "Камери": 0.5,
            "Куленепробивне скло": 0.4,
            "Ротація змін": 0.4
        },
        "6.1 3-7 хвилин": {
            "Найм охоронця": 0,
            "Установка тривожної кнопки": 0.8,
            "Датчики руху, сигналізація": 0.7,
            "Камери": -0.3,
            "Куленепробивне скло": 0,
            "Ротація змін": 0.3
        },
        "6.2 5-10 хвилин": {
            "Найм охоронця": 0,
            "Установка тривожної кнопки": -0.4,
            "Датчики руху, сигналізація": -0.5,
            "Камери": 0.1,
            "Куленепробивне скло": 0,
            "Ротація змін": 0
        },
        "6.3 10 хвилин і більше": {
            "Найм охоронця": 0,
            "Установка тривожної кнопки": -0.9,
            "Датчики руху, сигналізація": -0.7,
            "Камери": 0.4,
            "Куленепробивне скло": 0,
            "Ротація змін": 0
        },
        "7.1 Один": {
            "Найм охоронця": 0.3,
            "Установка тривожної кнопки": 0.4,
            "Датчики руху, сигналізація": 0.5,
            "Камери": 0,
            "Куленепробивне скло": 0,
            "Ротація змін": 0
        },
        "7.2 Два і більше": {
            "Найм охоронця": -0.5,
            "Установка тривожної кнопки": -0.4,
            "Датчики руху, сигналізація": -0.6,
            "Камери": 0,
            "Куленепробивне скло": 0,
            "Ротація змін": 0
        }
    }
df1 = pd.DataFrame(all_combinations, columns=parameters.keys())
df1["Ймовірність поділена на кореляцію"]=df["Ймовірність поділена на кореляцію"]
def R(row,correlation_matrix1,des):
    corr=1
    p1=row["Час пограбування"]
    p2=row["Наявність зброї у грабіжників"]
    p3=row["Наявність клієнтів"]
    p4=row["Доступність шляхів відходу"]
    p5=row["Розташування ломбарду"]
    p6=row["Швидкість прибуття поліції"]
    p7=row["Кількість злочинців"]
    param=[p1,p2,p3,p4,p5,p6,p7]
    for par in param:
        for keys,value in correlation_matrix1.items():
            if keys==par:
                corr=corr*(1+value[des])
    return corr

df1["R Найм охоронця"] = df1.apply(R, axis=1, args=(correlation_matrix1, "Найм охоронця"))
df1["R Установка тривожної кнопки"] = df1.apply(R, axis=1, args=(correlation_matrix1, "Установка тривожної кнопки"))
df1["R Датчики руху, сигналізація"] = df1.apply(R, axis=1, args=(correlation_matrix1, "Датчики руху, сигналізація"))
df1["R Камери"] = df1.apply(R, axis=1, args=(correlation_matrix1, "Камери"))
df1["R Куленепробивне скло"] = df1.apply(R, axis=1, args=(correlation_matrix1, "Куленепробивне скло"))
df1["R Ротація змін"] = df1.apply(R, axis=1, args=(correlation_matrix1, "Ротація змін"))
df1["Rн Найм охоронця"]= df1["R Найм охоронця"]/(df1["R Найм охоронця"]+df1["R Установка тривожної кнопки"]+df1["R Датчики руху, сигналізація"]+df1["R Камери"]+df1["R Куленепробивне скло"]+df1["R Ротація змін"])
df1["Rн Установка тривожної кнопки"]= df1["R Установка тривожної кнопки"]/(df1["R Найм охоронця"]+df1["R Установка тривожної кнопки"]+df1["R Датчики руху, сигналізація"]+df1["R Камери"]+df1["R Куленепробивне скло"]+df1["R Ротація змін"])
df1["Rн Датчики руху, сигналізація"]= df1["R Датчики руху, сигналізація"]/(df1["R Найм охоронця"]+df1["R Установка тривожної кнопки"]+df1["R Датчики руху, сигналізація"]+df1["R Камери"]+df1["R Куленепробивне скло"]+df1["R Ротація змін"])
df1["Rн Камери"]= df1["R Камери"]/(df1["R Найм охоронця"]+df1["R Установка тривожної кнопки"]+df1["R Датчики руху, сигналізація"]+df1["R Камери"]+df1["R Куленепробивне скло"]+df1["R Ротація змін"])
df1["Rн Куленепробивне скло"]= df1["R Куленепробивне скло"]/(df1["R Найм охоронця"]+df1["R Установка тривожної кнопки"]+df1["R Датчики руху, сигналізація"]+df1["R Камери"]+df1["R Куленепробивне скло"]+df1["R Ротація змін"])
df1["Rн Ротація змін"]= df1["R Ротація змін"]/(df1["R Найм охоронця"]+df1["R Установка тривожної кнопки"]+df1["R Датчики руху, сигналізація"]+df1["R Камери"]+df1["R Куленепробивне скло"]+df1["R Ротація змін"])
df1["Rн Найм охоронця*P"]=df1["Rн Найм охоронця"]*df1["Ймовірність поділена на кореляцію"]
df1["Rн Установка тривожної кнопки*P"]=df1["Rн Установка тривожної кнопки"]*df1["Ймовірність поділена на кореляцію"]
df1["Rн Датчики руху, сигналізація*P"]=df1["Rн Датчики руху, сигналізація"]*df1["Ймовірність поділена на кореляцію"]
df1["Rн Камери*P"]=df1["Rн Камери"]*df1["Ймовірність поділена на кореляцію"]
df1["Rн Куленепробивне скло*P"]=df1["Rн Куленепробивне скло"]*df1["Ймовірність поділена на кореляцію"]
df1["Rн Ротація змін*P"]=df1["Rн Ротація змін"]*df1["Ймовірність поділена на кореляцію"]
des1 = df1["Rн Найм охоронця*P"].sum()
des2 = df1["Rн Установка тривожної кнопки*P"].sum()
des3 = df1["Rн Датчики руху, сигналізація*P"].sum()
des4 = df1["Rн Камери*P"].sum()
des5 = df1["Rн Куленепробивне скло*P"].sum()
des6 = df1["Rн Ротація змін*P"].sum()
print(des1,des2,des3,des4,des5,des6)
print(df1)                                                                                
#print(palts)
#print("\nПерші 5 рядків повного набору даних:")
#print(df.head())
#print(df["Ймовірність на кореляцію"].sum())
#print(df["Ймовірність поділена на кореляцію"].sum())
